<template>
  <div class="bb">
      <!-- 第三步-------------------------------------------------------- -->
      <!-- 直接使用 单双标签都可以 -->
      <A/>  <!-- 这里展示的就是a.vue里的内容了 -->
      <!-- 第四步--------------组件传参 ------------------------------------------->
      <A v-show="flag" :list='list'/>   
      <!-- :list='list'  :list--随便起的名字记得加冒号，后边的是data里你要传的值  -->
  </div>
</template>

<script>

//第一步-------------------------------------------------------------------
//引入a组件 组件名字开头一定要大写
//第一个写法
import A from '../components/a.vue' //a.vue后缀可以省略
//第二个写法
import A from '@/components/a.vue' //@代表根目录src
export default {
    //第二步-----------------------------------------------------------
    //引入组件一定要注册，不然无法使用还报错
    components:{ //components不要忘记加s
        A    //注册成功
    },
    data(){ 
        return {
            flag:false,
            list:['1','2','3']
        }
    }
}
</script>
